{
  "group": {
    "title": "Reverse Chronological Resume",
    "note": "",
    "ordered": "yes",
    "standalone": "no",
    "category_id": 1,
    "short_name": "Reverse Chron",
    "cat_sort": 1
  },
  "paragraphs": [
    {
      "id": "",
      "subtitle": "",
      "note": "",
      "image_path": "",
      "image_info_key": "default",
      "text": ["<p>strong>Location:</strong> Charlottesville, VA</p>",
        "<p><strong>Email:</strong> elizabeth.schley@yahoo.com</p>",
        "<p>Experienced back end programmer who loves to program. For the past year, Python has been my main language, but for the seven years before that worked with Ruby and Php. Have four years of experience working with AWS (S3, EC2, SNS, SQS, Aurora & Cloudfront).</p>"
       ]
    },
    {
      "id": "",
      "subtitle": "CoConstruct, LLC",
      "text": ["<p><strong>QA Automation Engineer: </strong> Worked with devops quality engineers to develop a world class Azure Pipeline by setting up a UI testing framework and many tests that covered vital functionality, using data driven, screen scraping and object oriented approaches and caching for speed and efficiency.</p>",
          "<p><strong>Technologies:</strong> Python, Pytest, Selenium, Azure, SQL Server</p>",
          "<p>2019 – 2020 (5 months)</p>"
      ]
    },
    {
      "id": "",
      "subtitle": "Teachstone Training, LLC",
      "text": ["<p><strong>Backend Developer: </strong> Worked with developers, devops, product management, QA, content and customer service to create and maintain a web application to help teachers improve their interactions with their students.  The system interfaced with third party services, including BigCommerce, FedEx and Moodle, and in-house mobile applications and multiple applications using both restful and other Rails and PHP interfaces.  Played a large role in developing a single signon system for both third party and in-house systems.  Wrote many unit and integration tests.</p>",
          "<p><strong>Technologies:</strong> Rspec, Ruby, Rails, PHP, MySQL, New Relic, AWS</p>",
          "<p>2013 – 2019</p>"
      ]
    },
    {
      "id": "",
      "subtitle": "Automation Systems (Abbott)",
      "text": ["<p><strong>Project Manager: </strong> Helped lead many projects through conception to release, following FDA compliant software development practices, including test plan approval, risk management and problem solving strategies.</p>",
          "<p><strong>Technologies:</strong> Rspec, Ruby, Rails, PHP, MySQL, New Relic, AWS</p>",
          "<p>2013 – 2019</p>"
      ]
    },
    {
      "id": "",
      "subtitle": "LexisNexis, Senior Software Engineer",
      "text": ["<p><strong>Senior Software Engineer: </strong> Worked as technical lead and developer for a customer-facing eCommerce web-site that interfaced with multiple order fulfillment and financial back-end systems.  Responsible for both release and test plans, timely releases, unit and integration testing and project management.  Designed and wrote an object-oriented Java web service as one of several middle-ware strategies.</p>",
          "<p><strong>Technologies:</strong> Java web services, ASP, Javascript, XSLT, VB, FE</p>",
          "<p><strong>Computer Programmer: Moved from entry level position to Senior Software Engineer by taking courses, self-study, hard work and excellent results.  Worked on timecards, order fulfillment, invoices, pricing and subscription reporting.</strong> </p>",
          "<p><strong>Technologies:</strong> Java, JS,  VB, Oracle, Sybase, SQL Server, Mainframe</p>",
          "<p>1993 – 2007</p>"
      ]
    },
    {
      "id": "",
      "subtitle": "Education",
      "text": ["<ul><li>Masters of Science - Information Studies, Florida State University: 4.0 GPA</li>",
        "<li>BA in English, Old Dominion University</li>",
        "<li><Java Certified Java 2 Platform</li></ul>"
      ]
    }
  ]
}
